loadtest/results/2026-08-13/p2_auth_vu400.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: feed-auth-step.js
        output: -

     scenarios: (100.00%) 1 scenario, 400 max VUs, 2m0s max duration (incl. graceful stop):
              * default: 400 looping VUs for 1m30s (gracefulStop: 30s)


running (0m00.8s), 400/400 VUs, 76 complete and 0 interrupted iterations
default   [   1% ] 400 VUs  0m00.7s/1m30s

running (0m01.8s), 400/400 VUs, 224 complete and 0 interrupted iterations
default   [   2% ] 400 VUs  0m01.7s/1m30s

running (0m02.8s), 400/400 VUs, 368 complete and 0 interrupted iterations
default   [   3% ] 400 VUs  0m02.7s/1m30s

running (0m03.8s), 400/400 VUs, 518 complete and 0 interrupted iterations
default   [   4% ] 400 VUs  0m03.7s/1m30s

running (0m04.8s), 400/400 VUs, 667 complete and 0 interrupted iterations
default   [   5% ] 400 VUs  0m04.7s/1m30s

running (0m05.8s), 400/400 VUs, 819 complete and 0 interrupted iterations
default   [   6% ] 400 VUs  0m05.7s/1m30s

running (0m06.8s), 400/400 VUs, 969 complete and 0 interrupted iterations
default   [   7% ] 400 VUs  0m06.7s/1m30s

running (0m07.8s), 400/400 VUs, 1115 complete and 0 interrupted iterations
default   [   9% ] 400 VUs  0m07.7s/1m30s

running (0m08.8s), 400/400 VUs, 1264 complete and 0 interrupted iterations
default   [  10% ] 400 VUs  0m08.7s/1m30s

running (0m09.8s), 400/400 VUs, 1413 complete and 0 interrupted iterations
default   [  11% ] 400 VUs  0m09.7s/1m30s

running (0m10.8s), 400/400 VUs, 1563 complete and 0 interrupted iterations
default   [  12% ] 400 VUs  0m10.7s/1m30s

running (0m11.8s), 400/400 VUs, 1708 complete and 0 interrupted iterations
default   [  13% ] 400 VUs  0m11.7s/1m30s

running (0m12.8s), 400/400 VUs, 1859 complete and 0 interrupted iterations
default   [  14% ] 400 VUs  0m12.7s/1m30s

running (0m13.8s), 400/400 VUs, 2003 complete and 0 interrupted iterations
default   [  15% ] 400 VUs  0m13.7s/1m30s

running (0m14.8s), 400/400 VUs, 2153 complete and 0 interrupted iterations
default   [  16% ] 400 VUs  0m14.7s/1m30s

running (0m15.8s), 400/400 VUs, 2301 complete and 0 interrupted iterations
default   [  17% ] 400 VUs  0m15.7s/1m30s

running (0m16.8s), 400/400 VUs, 2451 complete and 0 interrupted iterations
default   [  19% ] 400 VUs  0m16.7s/1m30s

running (0m17.8s), 400/400 VUs, 2600 complete and 0 interrupted iterations
default   [  20% ] 400 VUs  0m17.7s/1m30s

running (0m18.8s), 400/400 VUs, 2745 complete and 0 interrupted iterations
default   [  21% ] 400 VUs  0m18.7s/1m30s

running (0m19.8s), 400/400 VUs, 2894 complete and 0 interrupted iterations
default   [  22% ] 400 VUs  0m19.7s/1m30s

running (0m20.8s), 400/400 VUs, 3043 complete and 0 interrupted iterations
default   [  23% ] 400 VUs  0m20.7s/1m30s

running (0m21.8s), 400/400 VUs, 3194 complete and 0 interrupted iterations
default   [  24% ] 400 VUs  0m21.7s/1m30s

running (0m22.8s), 400/400 VUs, 3341 complete and 0 interrupted iterations
default   [  25% ] 400 VUs  0m22.7s/1m30s

running (0m23.8s), 400/400 VUs, 3485 complete and 0 interrupted iterations
default   [  26% ] 400 VUs  0m23.7s/1m30s

running (0m24.8s), 400/400 VUs, 3636 complete and 0 interrupted iterations
default   [  27% ] 400 VUs  0m24.7s/1m30s

running (0m25.8s), 400/400 VUs, 3784 complete and 0 interrupted iterations
default   [  29% ] 400 VUs  0m25.7s/1m30s

running (0m26.8s), 400/400 VUs, 3933 complete and 0 interrupted iterations
default   [  30% ] 400 VUs  0m26.7s/1m30s

running (0m27.8s), 400/400 VUs, 4086 complete and 0 interrupted iterations
default   [  31% ] 400 VUs  0m27.7s/1m30s

running (0m28.8s), 400/400 VUs, 4226 complete and 0 interrupted iterations
default   [  32% ] 400 VUs  0m28.7s/1m30s

running (0m29.8s), 400/400 VUs, 4374 complete and 0 interrupted iterations
default   [  33% ] 400 VUs  0m29.7s/1m30s

running (0m30.8s), 400/400 VUs, 4521 complete and 0 interrupted iterations
default   [  34% ] 400 VUs  0m30.7s/1m30s

running (0m31.8s), 400/400 VUs, 4669 complete and 0 interrupted iterations
default   [  35% ] 400 VUs  0m31.7s/1m30s

running (0m32.8s), 400/400 VUs, 4816 complete and 0 interrupted iterations
default   [  36% ] 400 VUs  0m32.7s/1m30s

running (0m33.8s), 400/400 VUs, 4959 complete and 0 interrupted iterations
default   [  37% ] 400 VUs  0m33.7s/1m30s

running (0m34.8s), 400/400 VUs, 5108 complete and 0 interrupted iterations
default   [  39% ] 400 VUs  0m34.7s/1m30s

running (0m35.8s), 400/400 VUs, 5255 complete and 0 interrupted iterations
default   [  40% ] 400 VUs  0m35.7s/1m30s

running (0m36.8s), 400/400 VUs, 5402 complete and 0 interrupted iterations
default   [  41% ] 400 VUs  0m36.7s/1m30s

running (0m37.8s), 400/400 VUs, 5548 complete and 0 interrupted iterations
default   [  42% ] 400 VUs  0m37.7s/1m30s

running (0m38.8s), 400/400 VUs, 5698 complete and 0 interrupted iterations
default   [  43% ] 400 VUs  0m38.7s/1m30s

running (0m39.8s), 400/400 VUs, 5837 complete and 0 interrupted iterations
default   [  44% ] 400 VUs  0m39.7s/1m30s

running (0m40.8s), 400/400 VUs, 5984 complete and 0 interrupted iterations
default   [  45% ] 400 VUs  0m40.7s/1m30s

running (0m41.8s), 400/400 VUs, 6134 complete and 0 interrupted iterations
default   [  46% ] 400 VUs  0m41.7s/1m30s

running (0m42.8s), 400/400 VUs, 6282 complete and 0 interrupted iterations
default   [  47% ] 400 VUs  0m42.7s/1m30s

running (0m43.8s), 400/400 VUs, 6425 complete and 0 interrupted iterations
default   [  49% ] 400 VUs  0m43.7s/1m30s

running (0m44.8s), 400/400 VUs, 6563 complete and 0 interrupted iterations
default   [  50% ] 400 VUs  0m44.7s/1m30s

running (0m45.8s), 400/400 VUs, 6711 complete and 0 interrupted iterations
default   [  51% ] 400 VUs  0m45.7s/1m30s

running (0m46.8s), 400/400 VUs, 6856 complete and 0 interrupted iterations
default   [  52% ] 400 VUs  0m46.7s/1m30s

running (0m47.8s), 400/400 VUs, 7003 complete and 0 interrupted iterations
default   [  53% ] 400 VUs  0m47.7s/1m30s

running (0m48.8s), 400/400 VUs, 7150 complete and 0 interrupted iterations
default   [  54% ] 400 VUs  0m48.7s/1m30s

running (0m49.8s), 400/400 VUs, 7294 complete and 0 interrupted iterations
default   [  55% ] 400 VUs  0m49.7s/1m30s

running (0m50.8s), 400/400 VUs, 7443 complete and 0 interrupted iterations
default   [  56% ] 400 VUs  0m50.7s/1m30s

running (0m51.8s), 400/400 VUs, 7587 complete and 0 interrupted iterations
default   [  57% ] 400 VUs  0m51.7s/1m30s

running (0m52.8s), 400/400 VUs, 7741 complete and 0 interrupted iterations
default   [  59% ] 400 VUs  0m52.7s/1m30s

running (0m53.8s), 400/400 VUs, 7888 complete and 0 interrupted iterations
default   [  60% ] 400 VUs  0m53.7s/1m30s

running (0m54.8s), 400/400 VUs, 8030 complete and 0 interrupted iterations
default   [  61% ] 400 VUs  0m54.7s/1m30s

running (0m55.8s), 400/400 VUs, 8179 complete and 0 interrupted iterations
default   [  62% ] 400 VUs  0m55.7s/1m30s

running (0m56.8s), 400/400 VUs, 8329 complete and 0 interrupted iterations
default   [  63% ] 400 VUs  0m56.7s/1m30s

running (0m57.8s), 400/400 VUs, 8476 complete and 0 interrupted iterations
default   [  64% ] 400 VUs  0m57.7s/1m30s

running (0m58.8s), 400/400 VUs, 8626 complete and 0 interrupted iterations
default   [  65% ] 400 VUs  0m58.7s/1m30s

running (0m59.8s), 400/400 VUs, 8773 complete and 0 interrupted iterations
default   [  66% ] 400 VUs  0m59.7s/1m30s

running (1m00.8s), 400/400 VUs, 8917 complete and 0 interrupted iterations
default   [  67% ] 400 VUs  1m00.7s/1m30s

running (1m01.8s), 400/400 VUs, 9067 complete and 0 interrupted iterations
default   [  69% ] 400 VUs  1m01.7s/1m30s

running (1m02.8s), 400/400 VUs, 9216 complete and 0 interrupted iterations
default   [  70% ] 400 VUs  1m02.7s/1m30s

running (1m03.8s), 400/400 VUs, 9364 complete and 0 interrupted iterations
default   [  71% ] 400 VUs  1m03.7s/1m30s

running (1m04.8s), 400/400 VUs, 9513 complete and 0 interrupted iterations
default   [  72% ] 400 VUs  1m04.7s/1m30s

running (1m05.8s), 400/400 VUs, 9656 complete and 0 interrupted iterations
default   [  73% ] 400 VUs  1m05.7s/1m30s

running (1m06.8s), 400/400 VUs, 9804 complete and 0 interrupted iterations
default   [  74% ] 400 VUs  1m06.7s/1m30s

running (1m07.8s), 400/400 VUs, 9949 complete and 0 interrupted iterations
default   [  75% ] 400 VUs  1m07.7s/1m30s

running (1m08.8s), 400/400 VUs, 10096 complete and 0 interrupted iterations
default   [  76% ] 400 VUs  1m08.7s/1m30s

running (1m09.8s), 400/400 VUs, 10239 complete and 0 interrupted iterations
default   [  77% ] 400 VUs  1m09.7s/1m30s

running (1m10.8s), 400/400 VUs, 10384 complete and 0 interrupted iterations
default   [  79% ] 400 VUs  1m10.7s/1m30s

running (1m11.8s), 400/400 VUs, 10520 complete and 0 interrupted iterations
default   [  80% ] 400 VUs  1m11.7s/1m30s

running (1m12.8s), 400/400 VUs, 10664 complete and 0 interrupted iterations
default   [  81% ] 400 VUs  1m12.7s/1m30s

running (1m13.8s), 400/400 VUs, 10813 complete and 0 interrupted iterations
default   [  82% ] 400 VUs  1m13.7s/1m30s

running (1m14.8s), 400/400 VUs, 10961 complete and 0 interrupted iterations
default   [  83% ] 400 VUs  1m14.7s/1m30s

running (1m15.8s), 400/400 VUs, 11103 complete and 0 interrupted iterations
default   [  84% ] 400 VUs  1m15.7s/1m30s

running (1m16.8s), 400/400 VUs, 11254 complete and 0 interrupted iterations
default   [  85% ] 400 VUs  1m16.7s/1m30s

running (1m17.8s), 400/400 VUs, 11402 complete and 0 interrupted iterations
default   [  86% ] 400 VUs  1m17.7s/1m30s

running (1m18.8s), 400/400 VUs, 11548 complete and 0 interrupted iterations
default   [  87% ] 400 VUs  1m18.7s/1m30s

running (1m19.8s), 400/400 VUs, 11698 complete and 0 interrupted iterations
default   [  89% ] 400 VUs  1m19.7s/1m30s

running (1m20.8s), 400/400 VUs, 11843 complete and 0 interrupted iterations
default   [  90% ] 400 VUs  1m20.7s/1m30s

running (1m21.8s), 400/400 VUs, 11991 complete and 0 interrupted iterations
default   [  91% ] 400 VUs  1m21.7s/1m30s

running (1m22.8s), 400/400 VUs, 12139 complete and 0 interrupted iterations
default   [  92% ] 400 VUs  1m22.7s/1m30s

running (1m23.8s), 400/400 VUs, 12289 complete and 0 interrupted iterations
default   [  93% ] 400 VUs  1m23.7s/1m30s

running (1m24.8s), 400/400 VUs, 12432 complete and 0 interrupted iterations
default   [  94% ] 400 VUs  1m24.7s/1m30s

running (1m25.8s), 400/400 VUs, 12572 complete and 0 interrupted iterations
default   [  95% ] 400 VUs  1m25.7s/1m30s

running (1m26.8s), 400/400 VUs, 12715 complete and 0 interrupted iterations
default   [  96% ] 400 VUs  1m26.7s/1m30s

running (1m27.8s), 400/400 VUs, 12859 complete and 0 interrupted iterations
default   [  97% ] 400 VUs  1m27.7s/1m30s

running (1m28.8s), 400/400 VUs, 13003 complete and 0 interrupted iterations
default   [  99% ] 400 VUs  1m28.7s/1m30s

running (1m29.8s), 400/400 VUs, 13146 complete and 0 interrupted iterations
default   [ 100% ] 400 VUs  1m29.7s/1m30s

running (1m30.8s), 304/400 VUs, 13292 complete and 0 interrupted iterations
default ↓ [ 100% ] 400 VUs  1m30s

running (1m31.8s), 167/400 VUs, 13429 complete and 0 interrupted iterations
default ↓ [ 100% ] 400 VUs  1m30s

running (1m32.8s), 020/400 VUs, 13576 complete and 0 interrupted iterations
default ↓ [ 100% ] 400 VUs  1m30s


  █ THRESHOLDS 

    http_req_failed
    ✓ 'rate<0.05' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 27192   292.828387/s
    checks_succeeded...: 100.00% 27192 out of 27192
    checks_failed......: 0.00%   0 out of 27192

    ✓ status 200
    ✓ 본문 있음

    CUSTOM
    feed_auth_duration.............: avg=2.68s min=94.52ms  med=2.71s p(90)=2.8s p(95)=3.92s p(99)=4.05s max=5.41s

    HTTP
    http_req_duration..............: avg=2.68s min=94.02ms  med=2.71s p(90)=2.8s p(95)=3.92s p(99)=4.05s max=5.41s
      { expected_response:true }...: avg=2.68s min=94.02ms  med=2.71s p(90)=2.8s p(95)=3.92s p(99)=4.05s max=5.41s
    http_req_failed................: 0.00%  0 out of 13597
    http_reqs......................: 13597  146.424962/s

    EXECUTION
    iteration_duration.............: avg=2.68s min=135.18ms med=2.71s p(90)=2.8s p(95)=3.92s p(99)=4.05s max=5.41s
    iterations.....................: 13596  146.414194/s
    vus............................: 20     min=20         max=400
    vus_max........................: 400    min=400        max=400

    NETWORK
    data_received..................: 197 MB 2.1 MB/s
    data_sent......................: 4.3 MB 46 kB/s



running (1m32.9s), 000/400 VUs, 13596 complete and 0 interrupted iterations
default ✓ [ 100% ] 400 VUs  1m30s